app/controllers/contracts_controller.rb

  def index
    @contracts = Contract.all
---
SELECT `contracts`.* FROM `contracts`

  def destroy
    @contract.destroy
---
DELETE FROM `contracts` WHERE `contracts`.`id` = 28

    def set_contract
      @contract = Contract.find(params[:id])
---
SELECT  `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 28 LIMIT 1