app/controllers/payments_controller.rb

SELECT `payments`.* FROM `payments` WHERE `payments`.`contract_id` = 6 AND (time >= '2016-08-01' AND time <= '2016-02-04')
---
  def index
    @payments = @contract.payments
    @payments = @payments.date_filter(params[:from], params[:to]) if params[:from].present? && params[:to].present?

INSERT INTO `payments` (`contract_id`, `description`, `value`, `time`, `is_imported`, `is_deleted`, `created_at`, `updated_at`) VALUES (2, 'rent', 272, '2017-01-01 00:00:00', 0, 0, '2017-01-10 16:03:39', '2017-01-10 16:03:39')
---
  def create
    @payment = @contract.payments.new(payment_params)

    if @payment.save

UPDATE `payments` SET `description` = 'rent', `time` = '2017-01-01 00:00:00', `updated_at` = '2017-01-10 16:05:12' WHERE `payments`.`id` = 19
---
  def update
    if @payment.update(payment_params)

DELETE FROM `payments` WHERE `payments`.`id` = 22
---
  def destroy
    @payment.destroy

SELECT  `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 2 ORDER BY `contracts`.`id` ASC LIMIT 1
---
    def set_contract
      @contract = Contract.where(id: params[:contract_id]).first

SELECT  `payments`.* FROM `payments` WHERE `payments`.`contract_id` = 2 AND `payments`.`id` = 22 LIMIT 1
---
    def set_payment
      @payment = @contract.payments.find(params[:id])